research/papers.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-09-17 Sat 13:13 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Papers</title>
<meta name="author" content="Patrick D. Elliott" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/patrickdelliott.css" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.15.1/dist/katex.min.css" integrity="sha384-R4558gYOUz8mP9YWpZJjofhk+zx0AS11p36HnD2ZKj/6JR5z27gSSULCNHIRReVs" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<nav id="preamble" class="status">
<a class="active" href="/">Home</a>
<a href="/research/papers.html">Papers</a>
<a href="/research/slides-handouts.html">Talks</a>
<a href="/teaching.html">Teaching</a>
<a href="/resources.html">Resources</a>
<!-- <a href="https://blog.patrickdelliott.com">Blog</a> -->
<!-- <a href="https://notes.patrickdelliott.com">Notes</a> -->
</nav>
<main id="content" class="content">
<header>
<h1 class="title">Papers</h1>
</header>
<section id="outline-container-orgf928bb0" class="outline-2">
<h2 id="orgf928bb0">Manuscripts</h2>
<div class="outline-text-2" id="text-orgf928bb0">
</div>
<div id="outline-container-org8ea7794" class="outline-3">
<h3 id="org8ea7794">Partee conjunctions: projection and possibility</h3>
<div class="outline-text-3" id="text-org8ea7794">
<ul class="org-ul">
<li>In prep.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb7c811d" class="outline-3">
<h3 id="orgb7c811d">Crossover and accessibility in dynamic semantics</h3>
<div class="outline-text-3" id="text-orgb7c811d">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/005311">lingbuzz/005311</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga1cf7c9" class="outline-3">
<h3 id="orga1cf7c9">Towards a principled logic of anaphora</h3>
<div class="outline-text-3" id="text-orga1cf7c9">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/005562">lingbuzz/005562</a></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-orga7a9e00" class="outline-2">
<h2 id="orga7a9e00">2021</h2>
<div class="outline-text-2" id="text-orga7a9e00">
</div>
<div id="outline-container-org728e1ee" class="outline-3">
<h3 id="org728e1ee">A flexible scope theory of intensionality</h3>
<div class="outline-text-3" id="text-org728e1ee">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/005107">lingbuzz/005107</a></li>
<li>Accepted with minor revisions at <i>Linguistics &amp; Philosophy</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd17e4dc" class="outline-3">
<h3 id="orgd17e4dc">Who and what do <i>who</i> and <i>what</i> range over cross-linguistically?</h3>
<div class="outline-text-3" id="text-orgd17e4dc">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/003959">lingbuzz/003959</a></li>
<li>Accepted at <i>Journal of Semantics</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org70d98e4" class="outline-3">
<h3 id="org70d98e4">A plea for equality: remarks on Moltmann's semantics for clausal embedding</h3>
<div class="outline-text-3" id="text-org70d98e4">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/005440">lingbuzz/005440</a></li>
<li>Published in <i>Theoretical Linguistics</i>.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-orgc743656" class="outline-2">
<h2 id="orgc743656">2020</h2>
<div class="outline-text-2" id="text-orgc743656">
</div>
<div id="outline-container-org18424ea" class="outline-3">
<h3 id="org18424ea">Exceptional <i>de re</i> in continuation semantics</h3>
<div class="outline-text-3" id="text-org18424ea">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/005297">lingbuzz/005297</a></li>
<li>Published in <i>Proceedings of WCCFL 38</i>.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-orgb91cba9" class="outline-2">
<h2 id="orgb91cba9">2019</h2>
<div class="outline-text-2" id="text-orgb91cba9">
</div>
<div id="outline-container-org7feaf34" class="outline-3">
<h3 id="org7feaf34">Applicatives for anaphora and presupposition</h3>
<div class="outline-text-3" id="text-org7feaf34">
<ul class="org-ul">
<li>Published in <i>Proceedings of LENLS 18</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc1da085" class="outline-3">
<h3 id="orgc1da085">Exactly one theory of multiplicity inferences</h3>
<div class="outline-text-3" id="text-orgc1da085">
<ul class="org-ul">
<li>with Paul Marty.</li>
<li>Published in <i>Snippets</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org3618c2d" class="outline-3">
<h3 id="org3618c2d">Unconditional sluicing: a case of ineffable ellipsis</h3>
<div class="outline-text-3" id="text-org3618c2d">
<ul class="org-ul">
<li>with Andrew Murphy.</li>
<li>Published in <i>Snippets</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org698ec4e" class="outline-3">
<h3 id="org698ec4e">\#Only zero</h3>
<div class="outline-text-3" id="text-org698ec4e">
<ul class="org-ul">
<li>Published in <i>Snippets</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-org6db01f4" class="outline-3">
<h3 id="org6db01f4">Ineffability and unexhaustification</h3>
<div class="outline-text-3" id="text-org6db01f4">
<ul class="org-ul">
<li>with Uli Sauerland</li>
<li><a href="https://semanticsarchive.net/Archive/Tg3ZGI2M/Elliott.pdf">semanticsarchive/Tg3ZGI2M</a></li>
<li>Published in <i>Proceedings of Sinn und Bedeutung 23</i>.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org9f53104" class="outline-2">
<h2 id="org9f53104">2018</h2>
<div class="outline-text-2" id="text-org9f53104">
</div>
<div id="outline-container-org85797ec" class="outline-3">
<h3 id="org85797ec">Collective predication and ellipsis: another case of ineffability</h3>
<div class="outline-text-3" id="text-org85797ec">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/003963">lingbuzz/003963</a></li>
<li>Published in <i>Snippets</i>.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org6f6143b" class="outline-2">
<h2 id="org6f6143b">2017</h2>
<div class="outline-text-2" id="text-org6f6143b">
</div>
<div id="outline-container-orgf86e8ae" class="outline-3">
<h3 id="orgf86e8ae">Predicates of relevance and theories of question embedding</h3>
<div class="outline-text-3" id="text-orgf86e8ae">
<ul class="org-ul">
<li>Published in <i>Journal of Semantics</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc783261" class="outline-3">
<h3 id="orgc783261">Do superiority-violating multiple singular <i>which</i>-questions have pair-list readings?</h3>
<div class="outline-text-3" id="text-orgc783261">
<ul class="org-ul">
<li>with Andreea Nicolae and Yasu Sudo.</li>
<li>Published in <i>Snippets</i>.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org4e2fa5a" class="outline-2">
<h2 id="org4e2fa5a">2016</h2>
<div class="outline-text-2" id="text-org4e2fa5a">
</div>
<div id="outline-container-org228762b" class="outline-3">
<h3 id="org228762b">Explaining DPs vs. CPs without syntax</h3>
<div class="outline-text-3" id="text-org228762b">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/003128">lingbuzz/003128</a></li>
<li>Published in <i>Proceedings of CLS 52</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb454560" class="outline-3">
<h3 id="orgb454560">E-type readings of quantifiers under ellipsis: consequences for the identity condition</h3>
<div class="outline-text-3" id="text-orgb454560">
<ul class="org-ul">
<li>with Yasu Sudo</li>
<li><a href="https://ling.auf.net/lingbuzz/repo/semanticsArchive/article/001561">semanticsArchive/2QzYmEzO</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcc3b10e" class="outline-3">
<h3 id="orgcc3b10e">List readings of questions with conjoined singular <i>which</i>-phrases</h3>
<div class="outline-text-3" id="text-orgcc3b10e">
<ul class="org-ul">
<li>with Andreea Nicolae and Yasu Sudo</li>
<li><a href="https://ling.auf.net/lingbuzz/004193">lingbuzz/004193</a></li>
<li>Published in <i>Proceedings of NELS 46</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd5c35ca" class="outline-3">
<h3 id="orgd5c35ca">The sticky reading: VP ellipsis without parallel binding</h3>
<div class="outline-text-3" id="text-orgd5c35ca">
<ul class="org-ul">
<li>with Andreea Nicolae and Yasu Sudo</li>
<li><a href="https://ling.auf.net/lingbuzz/002900">lingbuzz/002900</a></li>
<li>Published in <i>Proceedings of SALT 24</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd236ce1" class="outline-3">
<h3 id="orgd236ce1">QR out of control</h3>
<div class="outline-text-3" id="text-orgd236ce1">
<ul class="org-ul">
<li>with Gary Thoms</li>
<li>Published in <i>Proceedings of WCCFL 33</i>.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org4688627" class="outline-2">
<h2 id="org4688627">2015</h2>
<div class="outline-text-2" id="text-org4688627">
</div>
<div id="outline-container-orgd2c5806" class="outline-3">
<h3 id="orgd2c5806">More variation in island repair: the clausal/non-clausal distinction</h3>
<div class="outline-text-3" id="text-orgd2c5806">
<ul class="org-ul">
<li>with Matt Barros and Gary Thoms.</li>
<li>Published in <i>Proceedings of CLS 49</i>.</li>
</ul>
</div>
</div>
</section>

<section id="outline-container-orgc6dc635" class="outline-2">
<h2 id="orgc6dc635">Dissertation</h2>
<div class="outline-text-2" id="text-orgc6dc635">
</div>
<div id="outline-container-org6af5301" class="outline-3">
<h3 id="org6af5301">Elements of clausal embedding</h3>
<div class="outline-text-3" id="text-org6af5301">
<ul class="org-ul">
<li><a href="https://ling.auf.net/lingbuzz/004991">lingbuzz/004991</a></li>
</ul>
</div>
</div>
</section>
</main>
</body>
</html>
